{"milestones":{"appraisal":"# Appraisal\n\nWhenever a buyer applies for financing, the lender will require that an appraisal be completed to determine the current market value of the home.  You are allowed to be present while the appraiser is at your home gathering information; however, it would not be appropriate to “hover”.   The appraiser will be taking measurements and photographs, both on the exterior and interior.  The overall condition, construction features, recent updates and any repairs/defects will also be noted.  Since some updates are not readily visible, it’s always a good idea to prepare a list of recent improvements that have been completed.  The same is true for special features such as 2’ x 6’ construction, high performance windows, etc.\n\nThe value of your home is primarily determined by a technique called the Sales Comparison Approach.  In this method, your home is compared to other homes that have recently sold (commonly called Comparables or “Comps”) and are adjusted for value influencing differences.  Although an appraiser typically finds comparables in the MLS, there can often be reliable sales that did not make it into the system. If you are aware of any nearby properties that recently sold that are similar to your home, it’s always a good idea to share this information with the appraiser.\n\nIt’s important to understand that the visit to your property by the appraiser is the starting point of the valuation process.  The analysis phase comes next and can take several days to do the necessary research.  After the written report is completed, it is submitted to underwriting for a thorough review. As you might imagine, the entire process can take quite some time to complete and we are notified as to the results.  Once notified, we promptly share this information with you.\n","closing":"# Closing\n\nCongratulations! We’re ready to head to the closing table! Here are a few things to know.  Once the final figures are available from the lender and title company, they will be forwarded to you for review. It is important to look over the closing statement, so we can help you understand it before we get to closing and it expedite the signing process.\n\nWhen heading to the title company, please be sure to bring the following items: photo ID, and all keys, garage openers, and repair receipts. Also, you will want to contact your utilities and insurance companies to let them know about the anticipated sale of your home (you will not want these items canceled until after closing). If you are expecting proceeds, you will want to let the title company know ahead of time if you would like a check or if you want your funds to be wired. Many banks will hold the check for several days, so that will be something you want to consider.\nIf all goes perfectly, a typical closing can last about 1 to 2 hours. After everything is signed by both parties, the paperwork is sent to the underwriters for final approval before funds are released and we can be on our way.\n","final-walk-through":"# Final Walk-Through\n\nThe purpose of a final walk-through is to ensure the property is the same condition at the time the Offer to Purchase was made. If any repairs or remedial action was required as part of the inspection process, the buyers will confirm the completion at this time. In many cases, a receipt will be required for the work completed.\n\nAt the time an initial Offer to Purchase Contract is made, many homes are furnished and have personal belongings including pictures on the walls, items in storage areas, and other things that obstruct a full view of all areas of the property. If during the moving process, any defects are revealed that were previously unknown or not visible, you will need to contact your agent immediately.\n\nThe Offer to Purchase Contract states that the home should be in “broom swept condition” at the time of transfer. This would be considered a minimum in terms of the property appearance. Buyers always appreciate receiving their new home in tip-top shape.\n\nAs a final note when packing, remember to review the Offer to Purchase Contract for the items that stay with the home. If you aren’t sure, contact your agent.\n","home-inspection":"# Home Inspection\n\nThe home inspection process is typically one of the first things to happen after going under contract. The buyer and inspector choose the date and time for the inspection and will request permission for access to your home.  Depending on the size and age of the improvements, this process usually takes about 2 ½ to 3 ½ hours. This is an opportunity for the inspector to speak candidly with the potential buyer to help them better understand the physical characteristics of the property. It would not be appropriate for you to be present during the home inspection.\n\nThere home inspection process commonly consists of 3 components: 1) the general property inspection;  2) termite inspection; and  3) environmental inspection (radon). Sometimes these are  completed by different inspectors. As with showings, the inspector will have access to the lock box and will confirm appointments with you. Keep in mind, there should be clear access to all areas that need to be inspected such as attic, mechanical equipment, and when appropriate the crawl space or cellar.\n\nOnce the inspection of your property is completed, a written report will be prepared for the buyer within a few days.  The buyer and their agent will then review these findings and decide if any remedial action is appropriate. The deadline for the buyer to submit the Inspection Responses is detailed in the Offer to Purchase Contract.  Once we have received these documents, we will discuss the options and determine a course of action. Once again, we have to be mindful of deadlines and time is of the essence.\n"}}